
/****************************************************************
-- DESCRIPTION: Добавяне на админ под подразбиране за достъп до системата.
****************************************************************/

INSERT INTO [dbo].[EMPLOYEES]
VALUES(0, '00000-000000-000', 1, 4,
'96JMYiWH75iem2zQZfm2dtnQSaXUHRSWbL75rGUVES/036/8HbUxgZQaP6wTssfPCNV1eD9gIjzV
RsHa811Y3emao3HNcfdoaUxQ3aSS4QBWIXEOTfVxxfZAX6cRrn+YegcNNZQcAEAxM4uWhMMicW4o
0wa8zliz5Vh0Ld2ULqw=' -- = 12345678
, 0, 'ADMIN', 'ADMIN', 'ADMIN', '0000000000', 0.0, '', '', '', '', '')
GO

/****************************************************************
-- DESCRIPTION: Инициализация на таблицата за приоритети на задача.
****************************************************************/

INSERT INTO [dbo].[TASK_PRIORITIES]
     VALUES(0, N'Важна и спешна', 1),
		   (0, N'Важна, но не толкова спешна', 2),
		   (0, N'Не толкова важна, но спешна', 3),
		   (0, N'Не толкова важна и не толкова спешна', 4)
GO

/****************************************************************
-- DESCRIPTION: Инициализация на таблицата за състояние на задача.
****************************************************************/

INSERT INTO [dbo].[TASK_STATES]
     VALUES(0, N'Незапочната', 0),
		   (0, N'В процес на изпълнение', 0),
		   (0, N'Завършена', 1)
GO
